In [1]:
#Name: Sayee Pradeepkumar Deshmukh
#Roll No:- 34
#CLass:- TY A

In [3]:
#import library
import pandas as pd

In [4]:
-------------------------------------------#series in pandas--------------------------------------------------
a=[10,20,30,40,50]
s=pd.Series(a,['q','w','e','r','t'])

#Various Operations on series
print("Printing whole series:-\n",s)                                   #printing complete series
print("\nAccessing single value in series:-\n",s['q'])                 #Accessing particular value in series
print("\nAccessing multiole values in series:-\n",s[['q','w','e']])    #Accessing multiole values in series
print("\nSeries after multiplyign with 2\n:-",s*2)                     #Multiplying series with 2
print("\nMin,Max,Avg:-\n",s.min(),s.max(),s.mean())                    #min,max and average
print("\nSum of all values in series:-\n",s.sum())                     #Sum of all values in the series
print("\nNumber of values in series:-\n",s.value_counts())             #Frequency of values in series 
print("\nType of series:-\n",type(s))                                  #Type of series

Printing whole series:-
 q    10
w    20
e    30
r    40
t    50
dtype: int64

Accessing single value in series:-
 10

Accessing multiole values in series:-
 q    10
w    20
e    30
dtype: int64

Series after multiplyign with 2
:- q     20
w     40
e     60
r     80
t    100
dtype: int64

Min,Max,Avg:-
 10 50 30.0

Sum of all values in series:-
 150

Number of values in series:-
 10    1
20    1
30    1
40    1
50    1
Name: count, dtype: int64

Type of series:-
 <class 'pandas.core.series.Series'>

In [44]:
---------------------------------------------#Sample dataset-------------------------------------------------
data={
    
    'Name':['Manav','Puneet','Durva','Sharwari','Aniruddha'],
    'Age':[10,13,15,19,24],
    'Class':['SY','TY','FY','SY','TY'],
    'Place Of Birth':['Andheri','Nashik','Kalyan','Kothrud','Warje']
    
}
df=pd.DataFrame(data)

#Various operations on dataframe

print(df)  #print data frame
print("\n")
print(df['Name'])  #Access particular column
print("\n")
print(df[['Name','Place Of Birth']])  #Access multiple columns
print("\n")
print("Minimum Age , Maximum Age , Average Age:-\n",df['Age'].min(),df['Age'].max(),df['Age'].mean())  #minimum,maximum and average of age
print("\n")
print(df.iloc[0])  #Accessing first row using index
print("\n")
print(df.iloc[0:3])  #Accessing multiple rows
print("\n")
print(df['Age']>15)  #filter column
print("\n")
print(df.loc[df['Age']>15])  #Print Column after aplling filter
print("\n")
print(df.loc[(df['Age']>15)&(df['Class']=='SY')])   #apply filter on 2 columns and print

        Name  Age Class Place Of Birth
0      Manav   10    SY        Andheri
1     Puneet   13    TY         Nashik
2      Durva   15    FY         Kalyan
3   Sharwari   19    SY        Kothrud
4  Aniruddha   24    TY          Warje


0        Manav
1       Puneet
2        Durva
3     Sharwari
4    Aniruddha
Name: Name, dtype: object


        Name Place Of Birth
0      Manav        Andheri
1     Puneet         Nashik
2      Durva         Kalyan
3   Sharwari        Kothrud
4  Aniruddha          Warje


Minimum Age , Maximum Age , Average Age:-
 10 24 16.2


Name                Manav
Age                    10
Class                  SY
Place Of Birth    Andheri
Name: 0, dtype: object


     Name  Age Class Place Of Birth
0   Manav   10    SY        Andheri
1  Puneet   13    TY         Nashik
2   Durva   15    FY         Kalyan


0    False
1    False
2    False
3     True
4     True
Name: Age, dtype: bool


        Name  Age Class Place Of Birth
3   Sharwari   19    SY        Kothrud
4  Aniruddha   24    TY          Warje


       Name  Age Class Place Of Birth
3  Sharwari   19    SY        Kothrud

In [45]:
df.head()  #Top 5 rows in the data frame

        Name  Age Class Place Of Birth
0      Manav   10    SY        Andheri
1     Puneet   13    TY         Nashik
2      Durva   15    FY         Kalyan
3   Sharwari   19    SY        Kothrud
4  Aniruddha   24    TY          Warje

In [46]:
df.tail()  #Last 5 rows in the data frame

        Name  Age Class Place Of Birth
0      Manav   10    SY        Andheri
1     Puneet   13    TY         Nashik
2      Durva   15    FY         Kalyan
3   Sharwari   19    SY        Kothrud
4  Aniruddha   24    TY          Warje

In [47]:
df.shape   #Noe of rows and columns in the dataframe

(5, 4)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            5 non-null      object
 1   Age             5 non-null      int64
 2   Class           5 non-null      object
 3   Place Of Birth  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

In [49]:
df.dtypes  #Datatype of all the columns

Name              object
Age                int64
Class             object
Place Of Birth    object
dtype: object

In [50]:
df.describe()  #gives min,max.mean of the dataframe

             Age
count   5.000000
mean   16.200000
std     5.449771
min    10.000000
25%    13.000000
50%    15.000000
75%    19.000000
max    24.000000

In [ ]:
------------------------------------#Dataset from kaggle - Diabetes datset-----------------------------------------
d=pd